Revit 2024 API
ViewFamilyType.DefaultTemplateId Property
 The default template id assigned to this view type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ElementId DefaultTemplateId { get; set; }
Visual Basic
Public Property DefaultTemplateId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ DefaultTemplateId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Remarks
 This value will be the view template for all newly created instances of this view type.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: val is not valid as a default template id.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
ViewFamilyType Class
Autodesk.Revit.DB Namespace